---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Disabled
enum: Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption
source: html/e41f4cbb-e7a9-9481-114d-7c1eb851834b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.Disabled

For a structural column, this disables rigid Link formation, unless the neighboring structural beam overrides the setting.
 For a structural beam, this disables rigid Link formation, overriding the neighboring structural column's setting.